/* 
  Localizable.strings
  QuickRecorder
  Created by apple on 2024/4/16.
  Italian translation edited by Piersandro Guerrera
*/

"System Audio" = "Audio di sistema";
"System Audio " = "Audio di sistema";
"Screen Area" = "Area dello schermo";
"Screen" = "Schermo";
"Application" = "Applicazione";
"Window" = "Finestra";
"Mobile Device" = "Dispositivo mobile";
"Preferences" = "Preferenze";
"No Title" = "Senza titolo";
"Display " = "Monitor";
"Select Applications" = "Seleziona applicazioni";
"Permission Required" = "Autorizzazione richiesta";
"Compatibility Warning" = "Avviso di compatibilità";
"You are using macOS 12.7.4\nOutput files will be randomly corrupted on this version of macOS!\n\nPlease upgrade to 12.7.5 to solve it." = "Stai utilizzando macOS 12.7.4\nI file di output saranno danneggiati casualmente su questa versione di macOS!\n\nAggiorna a 12.7.5 per risolvere il problema.";
"QuickRecorder needs screen recording permissions, even if you only intend on recording audio." = "QuickRecorder necessita dei permessi di registrazione dello schermo, anche se intendi solo registrare l'audio.";
"QuickRecorder needs permission to record your microphone." = "QuickRecorder necessita dei permessi per registrare il tuo microfono.";
"Please select a folder to save output files" = "Seleziona una cartella per salvare i file di output";
"Open Settings" = "Apri impostazioni";
"Quit" = "Esci";
"Cancel" = "Annulla";
"Please select the App(s) to record" = "Seleziona una o più applicazioni";
"Please select the window(s) to record" = "Seleziona una o più finestre";
"Please select the screen to record" = "Seleziona lo schermo da registrare";
"Refresh" = "Ricaricare";
"Start" = "Inizia";
"Resolution" = "Risoluzione";
"Frame Rate" = "FPS";
"Auto" = "Automatico";
"High (auto)" = "Alta (auto)";
"Normal (1x)" = "Normale (1x)";
"Low (0.5x)" = "Bassa (0.5x)";
"Quality" = "Qualità";
"Format" = "Formato";
"Encoder" = "Metodo di codifica";
"Low" = "Bassa";
"Medium" = "Media";
"High" = "Alta";
"Save Current Frame" = "Salva screenshot del fotogramma attuale";
"Record Cursor" = "Cursore";
"App's Audio" = "Audio dell'app";
"Microphone" = "Microfono";
"Background" = "Sfondo";
"Wallpaper" = "Desktop";
"Transparent" = "Trasparente";
"Yellow" = "Giallo";
"Green" = "Verde";
"Blue" = "Blu";
"Red" = "Rosso";
"Gray" = "Grigio";
"Black" = "Nero";
"White" = "Bianco";
"Orange" = "Arancione";
"Custom" = "Personalizzato";
"Audio Settings" = "Impostazioni audio";
"Video Settings" = "Impostazioni video";
"Exclude QuickRecorder itself" = "Escludi la finestra di QuickRecorder";
"Highlight the Mouse Cursor" = "Evidenzia il cursore del mouse";
"Not available for \"Single Window Capture\"" = "\"Cattura finestra singola\" non è supportata";
"Normal - 128Kbps" = "128Kbps";
"Good - 192Kbps" = "192Kbps";
"High - 256Kbps" = "256Kbps";
"Extreme - 320Kbps" = "320Kbps";
"Other Settings" = "Altre impostazioni";
"Opus doesn't support MP4, it will fall back to AAC" = "L'Opus non supporta MP4, ricadrà su AAC";
"Record Microphone to Main Track" = "Mixa tutte le tracce audio";
"If enabled, all files on the Desktop will be hidden from the video when recording." = "Se abilitato, tutti i file sul Desktop saranno nascosti dal video durante la registrazione.";
"These apps will be excluded when recording \"Screen\" or \"Screen Area\"\nBut if the app is launched after the recording starts, it cannot be excluded." = "Queste app saranno escluse quando si registra \"Schermo\" o \"Area dello schermo\"\n* Ma se l'app viene avviata dopo l'inizio della registrazione, non può essere esclusa";
"Exclude Files on Desktop" = "Nascondi i file sul desktop";
"Recording with Alpha Channel" = "Registrazione con canale Alpha";
"Delay Before Recording" = "Ritardo prima della registrazione";
"s" = "secondi";
"Close" = "Chiudi";
"Custom Background Color" = "Colore personalizzato";
"File size: %@" = "Dimensione del file: %@";
"Recording: " = "Registrazione: ";
"Preferences…" = "Preferenze…";
"Quit QuickRecorder" = "Esci da QuickRecorder";
"Multiple Windows" = "Finestre multiple";
"Multiple Apps" = "Applicazioni multiple";
"Unknown App" = "App sconosciuta";
"A Window" = "Una finestra";
"Output Folder" = "Salva file in";
"Currently set to \"%@\"" = "Attualmente: \"%@\"";
"/Recording at " = "/Registrazione a ";
"/Capturing at " = "/Cattura a ";
" (Cropped in " = " (Ritagliato in ";
"Recording Completed" = "Registrazione completata";
"Clip Saved" = "Clip salvato";
"File saved to: %@" = "File salvato in: %@";
"File saved to folder: %@" = "File salvato nella cartella: %@";
"Launch at login" = "Avvia al login";
"Shortcuts Settings" = "Impostazioni scorciatoie";
"Take Screenshot" = "Cattura schermata";
"Pause / Resume" = "Pausa / Riprendi";
"Stop Recording" = "Interrompi registrazione";
"Record System Audio" = "Registra l'audio di sistema";
"Record Current Screen" = "Registra lo schermo corrente";
"Record Topmost Window" = "Registra la finestra in primo piano";
"Select Area to Record" = "Seleziona l'area da registrare";
"Toggle Screen Magnifier" = "Lente d'ingrandimento dello schermo";
"Waiting on update…" = "In attesa di aggiornamento…";
"Include Menu Bar in Recording" = "Includi la barra dei menu";
"Excluded Apps" = "App escluse";
"Record with Camera:" = "Registra con la fotocamera:";
"Presenter Overlay Camera:" = "Fotocamera \"Modalità sovrapposizione\":";
"Can only be turned off on macOS 14.2 or later!" = "Può essere disattivato solo su macOS 14.2 o versioni successive!";
"Presenter Overlay Delay" = "Ritardo Modalità sovrapposizione";
"Open video trimmer after recording" = "Apri il rifinitore video dopo l'arresto";
"Unable to use camera overlayer when recording a single window!" = "Impossibile utilizzare la sovrapposizione della fotocamera durante la registrazione di una singola finestra!";
" Please use \"Presenter Overlay\"" = " Si prega di utilizzare \"Modalità sovrapposizione\"";
"No Devices Found!" = "Nessun dispositivo trovato!";
"No Cameras Found!" = "Nessuna fotocamera trovata!";
"Please unlock!" = "Si prega di sbloccare!";
"If you are on a call, enable \"Mute\"" = "Se sei in chiamata, abilita \"Muto\"";
"Preset" = "Predefinito";
"Mute" = "Muto";
"Select..." = "Seleziona...";
"QuickRecorder needs this permission to record your camera or mobile device." = "QuickRecorder necessita di questo permesso per registrare video dalla fotocamera o dal dispositivo mobile.";

//"Default" = "Predefinito";
"Pixel Format" = "Formato pixel";
"Color Space" = "Spazio colore";
"Check for Updates…" = "Verifica aggiornamenti…";
"Update Settings" = "Aggiorna impostazioni";
"Automatically check for updates" = "Controlla automaticamente gli aggiornamenti";
"Automatically download updates" = "Scarica automaticamente gli aggiornamenti";
"Connect your device via USB" = "Collega il tuo dispositivo tramite USB";
"Show Dock Icon" = "Mostra nel Dock";
"Show MenuBar Icon" = "Mostra nella barra dei menu";
"Icon Settings" = "Impostazioni icona";
"Still Processing" = "Elaborazione in corso";
"Mixing audio track..." = "Mixaggio della traccia audio...";
"minutes " = "minuti per interrompere automaticamente la registrazione";
" Stop after" = "Interrompi dopo";
"Don't remind me again" = "Non ricordarmelo più";
"OK" = "OK";
"Failed to save file" = "Errore nel salvataggio del file";
"Enable Acoustic Echo Cancellation" = "Cancellazione dell'eco acustico";

/*
"failed to fetch file for size indicator: %@" = "Errore nel recupero della dimensione del file: %@";
"[err] failed to fetch available content:" = "[errore] Impossibile recuperare il contenuto disponibile:";
"There needs to be at least one display connected" = "È necessario collegare almeno un monitor";
"capture failed" = "Cattura fallita";
"unknown audio format while setting audio settings: " = "Formato audio sconosciuto durante l'impostazione delle impostazioni audio";
"[no defaults]" = "[nessuna impostazione predefinita]";
"loaded unknown audio format: " = "Caricato formato audio sconosciuto: ";
"loaded unknown video format" = "Caricato formato video sconosciuto";
"unknown stream type" = "Tipo di stream sconosciuto";
"audio file writing issue" = "Errore nella scrittura del file audio";
"closing stream with error:\n" = "Chiusura del flusso con errore:\n";
"\nthis might be due to the window closing or the user stopping from the sonoma ui" = "\nQuesto potrebbe essere dovuto alla chiusura della finestra da parte dell'utente o all'interruzione dalla UI di Sonoma.";
*/


// Webcam-only recording
"Webcam" = "Webcam";
"Saving…" = "Salvataggio…";
"No camera is selected." = "Nessuna fotocamera selezionata.";
"Unable to start camera recording." = "Impossibile avviare la registrazione della fotocamera.";
"Could not open a video connection." = "Impossibile aprire una connessione video.";
"No video codecs are available for this camera." = "Nessun codec video disponibile per questa fotocamera.";
"Unable to start recording." = "Impossibile avviare la registrazione.";
"Another recording is already active." = "Un’altra registrazione è già in corso.";
"Camera permission is required." = "È richiesta l’autorizzazione per la fotocamera.";
"Camera access is denied. Allow camera access in System Settings." = "Accesso alla fotocamera negato. Consenti l’accesso nelle Impostazioni di Sistema.";
"Camera access is restricted." = "L’accesso alla fotocamera è limitato.";
"Microphone permission is required for the selected microphone." = "È richiesta l’autorizzazione per il microfono selezionato.";
"Microphone access is denied. Allow microphone access in System Settings." = "Accesso al microfono negato. Consenti l’accesso nelle Impostazioni di Sistema.";
"Microphone access is restricted." = "L’accesso al microfono è limitato.";
"Selected camera is unavailable." = "La fotocamera selezionata non è disponibile.";
"Unable to add the camera input." = "Impossibile aggiungere l’ingresso della fotocamera.";
"Selected microphone is unavailable." = "Il microfono selezionato non è disponibile.";
"Unable to create the microphone input: %@" = "Impossibile creare l’ingresso del microfono: %@";
"Unable to add the microphone input." = "Impossibile aggiungere l’ingresso del microfono.";
"Unable to add the movie output." = "Impossibile aggiungere l’uscita video.";
"Unable to start camera preview." = "Impossibile avviare l’anteprima della fotocamera.";
"This camera cannot be configured for SDR recording." = "Questa fotocamera non può essere configurata per la registrazione SDR.";
"Active camera format: %d × %d, %.0f–%.0f fps range" = "Formato attivo: %d × %d, intervallo %.0f–%.0f fps";
"Camera capture failed: %@" = "Acquisizione della fotocamera non riuscita: %@";
"Camera capture failed." = "Acquisizione della fotocamera non riuscita.";
"The camera was disconnected." = "La fotocamera è stata scollegata.";
"Select a writable folder before recording." = "Seleziona una cartella scrivibile prima di registrare.";
"Recording folder does not exist or is not writable." = "La cartella di registrazione non esiste o non è scrivibile.";
"Recording did not produce a playable MOV file." = "La registrazione non ha prodotto un file MOV riproducibile.";
"Recording failed: %@" = "Registrazione non riuscita: %@";
"Webcam-only recording" = "Registrazione solo webcam";
"No cameras were found." = "Nessuna fotocamera trovata.";
"No microphone" = "Nessun microfono";
"Preparing camera…" = "Preparazione della fotocamera…";
"Mirror preview" = "Anteprima speculare";
"Preview mirroring does not affect the saved video." = "L’anteprima speculare non modifica il video salvato.";
"Webcam recordings use MOV and SDR." = "Le registrazioni webcam usano MOV e SDR.";
"Microphone mute and echo cancellation are unavailable for webcam-only recording." = "La registrazione solo webcam non supporta la disattivazione del microfono e la cancellazione dell’eco.";
"Start preview" = "Avvia anteprima";
"Auto-stop is off" = "Arresto automatico disattivato";
"Stop after %d minutes" = "Arresta dopo %d minuti";
"Start recording" = "Avvia registrazione";
"Recording starts in %d seconds" = "La registrazione inizia tra %d secondi";
"Cancel countdown" = "Annulla conto alla rovescia";
"Starting recording…" = "Avvio della registrazione…";
"Stop recording" = "Arresta registrazione";
"Resume recording" = "Riprendi registrazione";
"Pause recording" = "Metti in pausa";
"Saving recording…" = "Salvataggio della registrazione…";
"Refresh devices" = "Aggiorna dispositivi";
"Unable to create the camera input: %@" = "Impossibile creare l’ingresso della fotocamera: %@";
"Recording stopped unexpectedly" = "Registrazione interrotta inaspettatamente";
"Camera" = "Fotocamera";


/* Webcam + screen recording */
"Webcam + Screen" = "Webcam + Schermo";
"Record one display with a webcam picture-in-picture." = "Registra uno schermo con la webcam in sovrimpressione.";
"Preparing screen and camera…" = "Preparazione di schermo e webcam…";
"Start preview to see the composite." = "Avvia l’anteprima per vedere la composizione.";
"SDR only. HDR, transparency, microphone mute and echo cancellation are unavailable." = "Solo SDR. HDR, trasparenza, disattivazione del microfono e cancellazione dell’eco non sono disponibili.";
"QuickRecorder windows are excluded. Presenter Overlay stops this recording." = "Le finestre di QuickRecorder sono escluse. L’overlay del presentatore interrompe questa registrazione.";
"Display" = "Schermo";
"Webcam position" = "Posizione webcam";
"Top left" = "In alto a sinistra";
"Top right" = "In alto a destra";
"Bottom left" = "In basso a sinistra";
"Bottom right" = "In basso a destra";
"Webcam size" = "Dimensione webcam";
"Mirror webcam in saved video" = "Specchia la webcam nel video salvato";
"Refresh sources" = "Aggiorna sorgenti";
"Display %u" = "Schermo %u";
"No displays were found." = "Nessuno schermo trovato.";
"Unable to load displays." = "Impossibile caricare gli schermi.";

/* Webcam + Screen recording errors */
"Webcam + Screen recording requires macOS 13 or later." = "La registrazione Webcam + Screen richiede macOS 13 o successivo.";
"Unable to add the camera video output." = "Impossibile aggiungere l'uscita video della fotocamera.";
"Unable to add the microphone audio output." = "Impossibile aggiungere l'uscita audio del microfono.";
"Unable to synchronize camera and display clocks." = "Impossibile sincronizzare gli orologi della fotocamera e del display.";
"The selected microphone was disconnected." = "Il microfono selezionato è stato scollegato.";
"Screen Recording permission is required for Webcam + Screen mode." = "Per la modalità Webcam + Screen è necessaria l'autorizzazione alla registrazione dello schermo.";
"Unable to access screen content: %@" = "Impossibile accedere ai contenuti dello schermo: %@";
"Unable to access screen content." = "Impossibile accedere ai contenuti dello schermo.";
"The selected display is unavailable." = "Il display selezionato non è disponibile.";
"The selected display has an unsupported size." = "Le dimensioni del display selezionato non sono supportate.";
"Unable to configure screen capture: %@" = "Impossibile configurare l'acquisizione dello schermo: %@";
"Webcam + Screen output: %d × %d at %d fps (%@, %@)" = "Output Webcam + Screen: %d × %d a %d fps (%@, %@)";
"Unable to start screen capture: %@" = "Impossibile avviare l'acquisizione dello schermo: %@";
"Webcam + Screen setup timed out. Please try again." = "Timeout durante la configurazione di Webcam + Screen. Riprova.";
"Unable to reserve a temporary recording file." = "Impossibile riservare un file temporaneo per la registrazione.";
"Unable to prepare the recording file." = "Impossibile preparare il file di registrazione.";
"No supported H.264 or HEVC video encoder is available." = "Non è disponibile un encoder video H.264 o HEVC supportato.";
"The video input cannot be added to the recording writer." = "Impossibile aggiungere l'ingresso video al writer di registrazione.";
"The microphone input cannot be added to the recording writer." = "Impossibile aggiungere l'ingresso del microfono al writer di registrazione.";
"The system audio input cannot be added to the recording writer." = "Impossibile aggiungere l'ingresso audio di sistema al writer di registrazione.";
"Unable to prepare the recording writer: %@" = "Impossibile preparare il writer di registrazione: %@";
"Timed out waiting for a valid screen and camera frame." = "Timeout durante l'attesa di un fotogramma valido dello schermo e della fotocamera.";
"Camera frames stopped arriving; recording has stopped." = "I fotogrammi della fotocamera non arrivano più. La registrazione è stata interrotta.";
"The recording writer is unavailable." = "Il writer di registrazione non è disponibile.";
"The recording output file already exists." = "Il file di output della registrazione esiste già.";
"Unable to start the recording writer." = "Impossibile avviare il writer di registrazione.";
"The recording writer could not keep up with incoming media." = "Il writer di registrazione non riesce a gestire i dati multimediali in ingresso.";
"Unable to allocate a video frame." = "Impossibile allocare un fotogramma video.";
"Unable to append a video frame." = "Impossibile aggiungere un fotogramma video.";
"Unable to append an audio sample." = "Impossibile aggiungere un campione audio.";
"The screen is blank; Webcam + Screen recording has stopped." = "Lo schermo è vuoto; la registrazione Webcam + Screen è stata interrotta.";
"The screen capture was suspended; Webcam + Screen recording has stopped." = "L'acquisizione dello schermo è stata sospesa; la registrazione Webcam + Screen è stata interrotta.";
"Screen capture failed: %@" = "Acquisizione dello schermo non riuscita: %@";
"Presenter Overlay is enabled. Turn it off to use Webcam + Screen." = "Presenter Overlay è attivo. Disattivalo per usare Webcam + Screen.";
"Recording did not produce a playable video." = "La registrazione non ha prodotto un video riproducibile.";
"Audio tracks could not be mixed." = "Impossibile mixare le tracce audio.";
"Audio tracks could not be mixed. The original multi-track recording was preserved at: %@" = "Impossibile mixare le tracce audio. La registrazione originale multitraccia è stata conservata in: %@";
"Unable to create a video composition." = "Impossibile creare una composizione video.";
"Unable to create an audio composition." = "Impossibile creare una composizione audio.";
"Unable to create a compatible audio mix export." = "Impossibile creare un'esportazione compatibile del mix audio.";
"Unable to reserve a temporary mix file." = "Impossibile riservare un file temporaneo per il mix.";
"The final recording file already exists." = "Il file finale della registrazione esiste già.";
"Audio tracks remain separate" = "Le tracce audio sono rimaste separate.";
"Unable to stop screen capture: %@" = "Impossibile interrompere l'acquisizione dello schermo: %@";


/* Webcam + screen recording */
"Audio mix export failed." = "Esportazione del mix audio non riuscita.";
"Final remux export failed." = "Esportazione finale non riuscita.";
"The mixed audio export did not produce exactly one audio track." = "Il mix esportato non contiene una sola traccia audio.";
"The original recording does not contain both audio tracks." = "La registrazione originale non contiene entrambe le tracce audio.";
"Unable to create a codec-preserving final export." = "Impossibile creare un’esportazione finale che mantenga il codec originale.";
"Unable to create a final video and audio composition." = "Impossibile creare la composizione audio e video finale.";
"Unable to reserve a temporary remux file." = "Impossibile riservare un file temporaneo per il remux.";
"The screen capture stopped unexpectedly." = "La cattura dello schermo si è interrotta in modo imprevisto.";
